import math

# print("Амин тигр")
# print(5 + 5)
# minus = "5"
# Артур = 3
# print(minus, Артур)
# Артур = Артур + 2
# print(Артур)
# Артур *= 4 # Артур = Артур * 4
# print(Артур)
# a = input("Введите имя : ")
# print("Твое имя :", a)
# b = input("Введите число : ")
# b = int(b)
# print("Твое число + 5 :", b + 5)
# import math
# print(math.pi)
# print(math.sqrt(b))
# print(math.sin(b))

# Задание №1

# a = int(input("Введите значение гипотенузы:  "))
# b = int(input("Введите значение первого катета: "))
# c = math.sqrt((a * a) - (b * b))
# print("Значение второго катета : ", c)

#Задание №2

# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# a,b = b,a
# print(a)
# print(b)

#Задание №3

a = int(input("Введите a: "))
b = int(input("Введите b: "))
c = int(input("Введите с: "))
d = b * b - 4 * a * c
x1 = (- b - math.sqrt(d)) / (2 * a)
x2 = (- b + math.sqrt(d)) / (2 * a)
print("Первый корень: ",x1)
print("Второй корень: ",x2)











































































































